In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# 索引方法
df['Age'][:5]

In [ ]:
df[['Name','Age']][:5] #只取这两列

### 使用坐标

In [ ]:
# 可以定位
df.iloc[0] #拿到索引为1的数据

In [ ]:
# 可以使用切片的形式获取哪几条，并且可以指定列
df.iloc[:5,1:3]

### 使用标签

In [ ]:
df_new = df.set_index('Name') #建议重新赋值，不要使用原来的变量去接受，因为我在这里遇到了 Name列不存在的问题
df_new.head()

In [ ]:
# 可以使用loc来获取
df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)']

In [ ]:
# 也可以获取这条数据的具体某一列，这样也行  df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)']['Age']
df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)','Age']

In [ ]:
# 从哪个人（索引）到哪个人 打印所有的列
df_new.loc['Cumings, Mrs. John Bradley (Florence Briggs Thayer)':'Futrelle, Mrs. Jacques Heath (Lily May Peel)'
          ,:]

In [ ]:
# 修改值
df_new.loc['Allen, Mr. William Henry','Fare'] = 1000

In [ ]:
df_new.loc['Allen, Mr. William Henry']

In [ ]:
# bool类型的索引
"""获取年龄小于18的"""
df_new['Age'] <18

In [ ]:
df_new[df_new['Age'] <18] #可以用上面返回的结果集作为索引

In [ ]:
"""求一下男性的平均年龄"""
df_new[df_new['Sex'] == 'male']['Age'].mean()

In [ ]:
df_new.loc[df_new['Sex'] == 'male','Age'].mean()

In [3]:
df_new.loc[df_new['Sex'] == 'male','Age'].mean()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [4]:
df[['Name','Age']][:5] #只取这两列

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

### 使用坐标

In [5]:
# 可以定位
df.iloc[0] #拿到索引为1的数据

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [6]:
# 可以使用切片的形式获取哪几条，并且可以指定列
df.iloc[:5,1:3]

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3

### 使用标签

In [7]:
df_new = df.set_index('Name') #建议重新赋值，不要使用原来的变量去接受，因为我在这里遇到了 Name列不存在的问题
df_new.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
# 可以使用loc来获取
df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)']

PassengerId         4
Survived            1
Pclass              1
Sex            female
Age                35
SibSp               1
Parch               0
Ticket         113803
Fare             53.1
Cabin            C123
Embarked            S
Name: Futrelle, Mrs. Jacques Heath (Lily May Peel), dtype: object

In [9]:
# 也可以获取这条数据的具体某一列，这样也行  df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)']['Age']
df_new.loc['Futrelle, Mrs. Jacques Heath (Lily May Peel)','Age']

35.0

In [10]:
# 从哪个人（索引）到哪个人 打印所有的列
df_new.loc['Cumings, Mrs. John Bradley (Florence Briggs Thayer)':'Futrelle, Mrs. Jacques Heath (Lily May Peel)'
          ,:]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S

In [11]:
# 修改值
df_new.loc['Allen, Mr. William Henry','Fare'] = 1000

In [12]:
df_new.loc['Allen, Mr. William Henry']

PassengerId         5
Survived            0
Pclass              3
Sex              male
Age                35
SibSp               0
Parch               0
Ticket         373450
Fare             1000
Cabin             NaN
Embarked            S
Name: Allen, Mr. William Henry, dtype: object

In [13]:
# bool类型的索引
"""获取年龄小于18的"""
df_new['Age'] <18

Name
Braund, Mr. Owen Harris                                False
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    False
Heikkinen, Miss. Laina                                 False
Futrelle, Mrs. Jacques Heath (Lily May Peel)           False
Allen, Mr. William Henry                               False
                                                       ...
Montvila, Rev. Juozas                                  False
Graham, Miss. Margaret Edith                           False
Johnston, Miss. Catherine Helen "Carrie"               False
Behr, Mr. Karl Howell                                  False
Dooley, Mr. Patrick                                    False
Name: Age, Length: 891, dtype: bool

In [14]:
df_new[df_new['Age'] <18] #可以用上面返回的结果集作为索引

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S
"Nasser, Mrs. Nicholas (Adele Achem)",10,1,2,female,14.0,1,0,237736,30.0708,NaN,C
"Sandstrom, Miss. Marguerite Rut",11,1,3,female,4.0,1,1,PP 9549,16.7000,G6,S
"Vestrom, Miss. Hulda Amanda Adolfina",15,0,3,female,14.0,0,0,350406,7.8542,NaN,S
"Rice, Master. Eugene",17,0,3,male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
"Andersson, Master. Sigvard Harald Elias",851,0,3,male,4.0,4,2,347082,31.2750,NaN,S
"Boulos, Miss. Nourelain",853,0,3,female,9.0,1,1,2678,15.2458,NaN,C
"Lines, Miss. Mary Conover",854,1,1,female,16.0,0,1,PC 17592,39.4000,D28,S
"Johnson, Master. Harold Theodor",870,1,3,male,4.0,1,1,347742,11.1333,NaN,S
"Najib, Miss. Adele Kiamie ""Jane""",876,1,3,female,15.0,0,0,2667,7.2250,NaN,C

In [15]:
"""求一下男性的平均年龄"""
df_new[df_new['Sex'] == 'male']['Age'].mean()

30.72664459161148

In [16]:
df_new.loc[df_new['Sex'] == 'male','Age'].mean()

30.72664459161148